# GetNumberOfUnits Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
AnalysisResultSchema..::..GetNumberOfUnits Method
AnalysisResultSchema Class See Also
---
returns number of possible units
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public int GetNumberOfUnits()
```

Visual Basic
---
```text
Public Function GetNumberOfUnits As Integer
```

Visual C++
---
```text
public:
int GetNumberOfUnits()
```

# See Also
AnalysisResultSchema Class
Autodesk.Revit.DB.Analysis Namespace